УчетИНагрузкаППС/src/Enums/ВидыЗанятости/ВидыЗанятости.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыЗанятости</name>
  <enumValues>
    <name>Основное</name>
  </enumValues>
  <enumValues>
    <name>ВнутреннееСовместительство</name>
  </enumValues>
  <enumValues>
    <name>ВнешнееСовместительство</name>
  </enumValues>
  <enumValues>
    <name>Почасовое</name>
  </enumValues>
</mdclass:Enum>

УчетИНагрузкаППС/src/CommonModules/ШтатноеРасписаниеКлиентСервер/Module.bsl
#Область ПрограммныйИнтерфейс

Функция ОпределитьВидЗаписиПоВидуЗанятости(ВидЗанятости) Экспорт
	
	Если ВидЗанятости = ПредопределенноеЗначение("Перечисление.ВидыЗанятости.Основное") Тогда
		Возврат ПредопределенноеЗначение("Справочник.ВидыЗаписейШтатногоРасписания.ШтатныеПреподаватели");
	ИначеЕсли ВидЗанятости = ПредопределенноеЗначение("Перечисление.ВидыЗанятости.ВнешнееСовместительство") Тогда
		Возврат ПредопределенноеЗначение("Справочник.ВидыЗаписейШтатногоРасписания.СовместителиВнешние");
	ИначеЕсли ВидЗанятости = ПредопределенноеЗначение("Перечисление.ВидыЗанятости.ВнутреннееСовместительство") Тогда
		Возврат ПредопределенноеЗначение("Справочник.ВидыЗаписейШтатногоРасписания.СовместителиВнутренние");
	ИначеЕсли ВидЗанятости = ПредопределенноеЗначение("Перечисление.ВидыЗанятости.Почасовое") Тогда
		Возврат ПредопределенноеЗначение("Справочник.ВидыЗаписейШтатногоРасписания.ПочасоваяОплатаБезДОТ");
	КонецЕсли;
	
КонецФункции

#КонецОбласти
